Revit 2027 API
AreaCreationData(Object) Constructor
Initializes a new instance of the AreaCreationData class
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AreaCreationData(
	Object proxy
)
Public Sub New (
	proxy As Object
)
public:
AreaCreationData(
	Object^ proxy
)
new :
        proxy : Object -> AreaCreationData
Parameters
proxy Object
See Also
Reference
AreaCreationData Class
AreaCreationData Overload
Autodesk.Revit.Creation Namespace